
### :robot: Terraform Report
---
##### Plan: `2` to add, `1` to change, `2` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # helm_release.argocd[0] will be created
  + resource "helm_release" "argocd" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "7.6.12"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "configs.params.\"server.insecure\""
          + value = "true"
        }
      + set {
          + name  = "global.domain"
          + value = "argocd.example.com"
        }
    }

  # helm_release.istio_gateway[0] will be created
  + resource "helm_release" "istio_gateway" {
      + atomic                     = false
      + chart                      = "gateway"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "istio-gateway"
      + namespace                  = "istio-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://istio-release.storage.googleapis.com/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.23.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # helm_release.traefik[0] will be destroyed
  # (because helm_release.traefik is not in configuration)
  - resource "helm_release" "traefik" {
      - atomic                     = false -> null
      - chart                      = "traefik" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "traefik" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version    = "v3.1.6"
              - chart          = "traefik"
              - first_deployed = 1729722314
              - last_deployed  = 1729730709
              - name           = "traefik"
              - namespace      = "traefik"
              - notes          = <<-EOT
                    traefik with docker.io/traefik:v3.1.6 has been deployed successfully on traefik namespace !
                EOT
              - revision       = 2
              - values         = jsonencode(
                    {
                      - additionalArguments = [
                          - "--serversTransport.insecureSkipVerify=true",
                          - "--log.level=INFO",
                        ]
                      - deployment          = {
                          - additionalContainers = []
                          - annotations          = {}
                          - enabled              = true
                          - initContainers       = []
                          - podAnnotations       = {}
                          - replicas             = 3
                        }
                      - globalArguments     = [
                          - "--global.sendanonymoususage=false",
                          - "--global.checknewversion=false",
                        ]
                      - ingressRoute        = {
                          - dashboard = {
                              - enabled = false
                            }
                        }
                      - ports               = {
                          - web       = {
                              - redirectTo = {
                                  - port = "websecure"
                                }
                            }
                          - websecure = {
                              - tls = {
                                  - enabled = true
                                }
                            }
                        }
                      - providers           = {
                          - kubernetesCRD     = {
                              - enabled      = true
                              - ingressClass = "traefik-external"
                            }
                          - kubernetesIngress = {
                              - enabled          = true
                              - publishedService = {
                                  - enabled = true
                                }
                            }
                        }
                      - rbac                = {
                          - enabled = true
                        }
                      - service             = {
                          - annotations              = {}
                          - enabled                  = true
                          - externalIPs              = []
                          - labels                   = {}
                          - loadBalancerSourceRanges = []
                          - type                     = "LoadBalancer"
                        }
                    }
                )
              - version        = "32.1.1"
            },
        ] -> null
      - name                       = "traefik" -> null
      - namespace                  = "traefik" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://traefik.github.io/charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<-EOT
                globalArguments:
                  - "--global.sendanonymoususage=false"
                  - "--global.checknewversion=false"
                
                additionalArguments:
                  - "--serversTransport.insecureSkipVerify=true"
                  - "--log.level=INFO"
                
                deployment:
                  enabled: true
                  replicas: 3
                  annotations: {}
                  podAnnotations: {}
                  additionalContainers: []
                  initContainers: []
                
                ports:
                  web:
                    redirectTo:
                      port: websecure
                  websecure:
                    tls:
                      enabled: true
                      
                ingressRoute:
                  dashboard:
                    enabled: false
                
                providers:
                  kubernetesCRD:
                    enabled: true
                    ingressClass: traefik-external
                  kubernetesIngress:
                    enabled: true
                    publishedService:
                      enabled: true
                
                rbac:
                  enabled: true
                
                service:
                  enabled: true
                  type: LoadBalancer
                  annotations: {}
                  labels: {}
                  loadBalancerSourceRanges: []
                  externalIPs: []
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "32.1.1" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # kubernetes_namespace.namespace-prometheus will be updated in-place
  ~ resource "kubernetes_namespace" "namespace-prometheus" {
        id                               = "monitoring"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ labels           = {
              - "istio-injection" = "enabled" -> null
            }
            name             = "monitoring"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_namespace.namespace-traefik will be destroyed
  # (because kubernetes_namespace.namespace-traefik is not in configuration)
  - resource "kubernetes_namespace" "namespace-traefik" {
      - id                               = "traefik" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {
              - "istio-injection" = "enabled"
            } -> null
          - name             = "traefik" -> null
          - resource_version = "387437" -> null
          - uid              = "31a4df4a-9427-4a5e-84c1-03f432b09636" -> null
        }
    }

Plan: 2 to add, 1 to change, 2 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11491732434`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11491732434) - commit 28c88aaf01e1e203ec52c6fbe302564a6f1d4286
